Revit 2027 API
DuctSettings.AirDensity Property
 The air density in kg/ft^3.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AirDensity { get; set; }
Public Property AirDensity As Double
	Get
	Set
public:
property double AirDensity {
	double get ();
	void set (double value);
}
member AirDensity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for airDensity must be non-negative.
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace